In [2]:
import pandas as pd
import numpy as np
print(pd.__version__)

2.1.1

In [3]:
used_car = pd.read_csv('usedcars.csv')

In [4]:
used_car.head()

   year model  price  mileage   color transmission
0  2011   SEL  21992   7413.0  Yellow         AUTO
1  2011   SEL  20995  10926.0    Gray         AUTO
2  2011   SEL  19995   7351.0  Silver         AUTO
3  2011   SEL  17809  11613.0    Gray         AUTO
4  2012    SE  17500   8367.0   White         AUTO

In [8]:
used_car.tail()

     year model  price  mileage   color transmission
145  2006   SES   6200      NaN  Silver         AUTO
146  2002    SE   5995      NaN     Red         AUTO
147  2000    SE   5980      NaN     Red         AUTO
148  2001    SE   4899      NaN  Yellow         AUTO
149  2000    SE   3800      NaN     Red         AUTO

In [6]:
used_car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          150 non-null    int64
 1   model         150 non-null    object
 2   price         150 non-null    int64
 3   mileage       129 non-null    float64
 4   color         150 non-null    object
 5   transmission  150 non-null    object
dtypes: float64(1), int64(2), object(3)
memory usage: 7.2+ KB

In [7]:
used_car.describe()

              year         price        mileage
count   150.000000    150.000000     129.000000
mean   2008.993333  14242.353333   37531.666667
std       3.288166   9773.811205   20122.776366
min    2000.000000   3800.000000    4867.000000
25%    2008.000000  10995.000000   24920.000000
50%    2009.000000  13631.000000   35574.000000
75%    2010.000000  14989.750000   44518.000000
max    2030.000000  90000.000000  127327.000000